core/app/Http/Controllers/Gateway/PaymentController.php

update `users` set `balance` = `balance` - 22500, `users`.`updated_at` = '2024-07-24 05:59:38' where `id` = 2956
---
            }


            User::where('id', Auth::id())->decrement('balance', $charge_amount);

insert into `orders` (`user_id`, `total_amount`, `status`, `name`, `updated_at`, `created_at`) values (2956, 22500, 1, 'STANDARD USA 🇺🇸 200+', '2024-07-24 05:59:38', '2024-07-24 05:59:38')
---
            $order->user_id = Auth::id();
            $order->total_amount = $charge_amount;
            $order->status = 1;
            $order->save();

select * from `referres` where `refrere` = 'lopppy' limit 1
update `users` set `ref_wallet` = `ref_wallet` + 225, `users`.`updated_at` = '2024-07-24 05:59:38' where `username` = 'jimmy22'
---

                }

                $ck_ref = Referre::where('refrere', Auth::user()->username)->where('status', 0)->first()->referer ?? null;
                if($ck_ref != null){
                    Referre::where('referer', $ck_ref)->where('refrere', Auth::user()->username)->update(['status' => 1]);
                   $ref_amount = Referre::where('referer', $ck_ref)->first()->amount;
                    User::where('username', $ck_ref)->increment('ref_wallet', $ref_amount);