core/app/Http/Controllers/User/UserController.php

select count(*) as aggregate from `support_tickets` where `user_id` = 2499
select * from `deposits` where `user_id` = 2499 order by `created_at` desc, `id` desc limit 10
select * from `orders` where `orders`.`id` in (0)
---
    public function home()
    {
        $pageTitle = 'Dashboard';
        $user = auth()->user();

        $widget['total_payments'] = Deposit::where('user_id', $user->id)->successful()->sum('amount');
        $widget['total_orders'] = Order::where('user_id', $user->id)->paid()->count();
        $widget['total_tickets'] = SupportTicket::where('user_id', $user->id)->count();

        //$latestDeposits = $user->deposits()->take(5)->get();

        $latestDeposits = Deposit::latest()->where('user_id', Auth::id())->with('gateway', 'order')->orderBy('id', 'desc')->take(10)->get();

select sum(`amount`) as aggregate from `referres` where `email` = 'tolu@gmail.com' and `status` = 1
select sum(`final_amo`) as aggregate from `deposits` where `user_id` = 2499 and `status` = 4
select * from `referres` where `email` = 'tolu@gmail.com' limit 10 offset 0
select count(*) as aggregate from `referres` where `email` = 'tolu@gmail.com'
---
    public function refer(request $request)
    {

        if(Auth::user()->refer == null){

            $code = random_int(00000, 99999);
            $url = url('')."/user/register?code=$code";
            User::where('id', Auth::id())->update(['refer' => $url, 'referal_code'=> $code]);
            $data['refer'] = Auth::user()->refer;

            $data['earned'] = Referre::where('email', Auth::user()->email)->where('status', 1)->sum('amount');
            $data['withdrawal'] = Deposit::where('user_id', Auth::id())->where('status', 3)->sum('final_amo');




            return view($this->activeTemplate . 'user.referal', $data);
        }else{


            $data['earned'] = Referre::where('email', Auth::user()->email)->where('status', 1)->sum('amount');
            $data['withdrawal'] = Deposit::where('user_id', Auth::id())->where('status', 4)->sum('final_amo');
            $data['referal'] = Referre::where('email', Auth::user()->email)->paginate('10');

select * from `gateway_currencies`
select count(*) as aggregate from `deposits` where `user_id` = 2499
---
    public function depositNew(Request $request)
    {
        $pageTitle = 'Fund Wallet';
        $gateway_currency = GatewayCurrency::all();
        $deposits = Deposit::latest()->where('user_id', Auth::id())->with('gateway', 'order')->paginate('5');

select * from `deposits` where `deposits`.`order_id` in (362, 363, 364, 365, 366, 367, 368, 369, 370, 371, 372, 373, 374, 375, 376, 377, 378, 379, 380, 381, 382, 383, 384, 385, 386, 387, 388, 389, 390, 391)
select * from `order_items` where `order_items`.`order_id` in (362, 363, 364, 365, 366, 367, 368, 369, 370, 371, 372, 373, 374, 375, 376, 377, 378, 379, 380, 381, 382, 383, 384, 385, 386, 387, 388, 389, 390, 391)
select * from `orders` where `user_id` = 2956 and `status` = 1 order by `id` desc limit 30 offset 0
select count(*) as aggregate from `orders` where `user_id` = 2499 and `status` = 1
select count(*) as aggregate from `orders` where `user_id` = 2956 and `status` = 1
select sum(`total_amount`) as aggregate from `orders` where `user_id` = 2956 and `status` = 1
---
    public function orders()
    {
        $pageTitle = 'Orders';

        $orders = Order::where('user_id', auth()->id())
            ->where('status', Status::ORDER_PAID)
            ->searchable(['deposit:trx'])
            ->orderBy('id', 'desc')
            ->with('deposit', 'orderItems')
            ->paginate(getPaginate());




        $count_order = Order::where('user_id', Auth::id())->where('status', 1)->count();
        $order_sum = Order::where('user_id', Auth::id())->where('status', 1)->sum('total_amount');

update `users` set `ref_wallet` = `ref_wallet` - 100, `users`.`updated_at` = '2024-07-24 04:40:53' where `id` = 2499
---
    public function send_money(request $request)
    {


        if(Auth::user()->ref_wallet < $request->amount){
            return back()->with('error', "Insufficient Referral Funds");
        }

        User::where('id', Auth::id())->decrement('ref_wallet', $request->amount);

update `users` set `ref_wallet` = `ref_wallet` + 100, `users`.`updated_at` = '2024-07-24 04:40:55' where `id` = 2499
---

            return back()->with('message', "Funds sent successfully");
        }else{
            User::where('id', Auth::id())->increment('ref_wallet', $request->amount);