core/app/Http/Controllers/User/UserController.php

    public function refer(request $request)
    {

        if(Auth::user()->refer == null){

            $code = random_int(00000, 99999);
            $url = url('')."/user/register?code=$code";
            User::where('id', Auth::id())->update(['refer' => $url, 'referal_code'=> $code]);
            $data['refer'] = Auth::user()->refer;

            $data['earned'] = Deposit::where('method_code', 6000)->where('status', 1)->sum('amount');
            $data['withdrawal'] = Deposit::where('user_id', Auth::id())->where('status', 3)->sum('final_amo');


            return view($this->activeTemplate . 'user.referal', $data);
        }else{


            $data['earned'] = Deposit::where('method_code', 6000)->where('user_id', Auth::id())->sum('amount');
            $data['withdrawal'] = Deposit::where('user_id', Auth::id())->where('status', 4)->sum('final_amo');
            $data['referal'] = Deposit::latest()->where('method_code', 6000)->where('user_id', Auth::id())->paginate('10');
---
select sum(`amount`) as aggregate from `deposits` where `method_code` = 6000 and `user_id` = 2499
select * from `deposits` where `method_code` = 6000 and `user_id` = 2499 limit 10 offset 10
select count(*) as aggregate from `deposits` where `method_code` = 6000 and `user_id` = 2499